In [18]:
import pandas as pd
import sqlite3

In [2]:
geo_database = pd.read_csv('test.csv',header=None)
geo_database.head()

/tmp/ipykernel_141367/2170154904.py:1: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  geo_database = pd.read_csv('test.csv',header=None)

,0,1,2,3,4,5,6,7
0,1763,W,WELLINGTON,AVE,60657,41.935796,-87.673357,1763 W WELLINGTON AVE
1,1622,W,CULLERTON,ST,60608,41.855258,-87.667139,1622 W CULLERTON ST
2,917,W,ARMITAGE,AVE,60614,41.917926,-87.651651,917 W ARMITAGE AVE
3,1132,S,WABASH,AVE,60605,41.868253,-87.626334,1132 S WABASH AVE
4,732,N,WILLARD,CT,60642,41.895400,-87.658712,732 N WILLARD CT

In [4]:
geo_database.columns = ['numerical','direction','streetname','abvr','zipcode','lat', 'long', 'full']

In [5]:
geo_database.head()

,numerical,direction,streetname,abvr,zipcode,lat,long,full
0,1763,W,WELLINGTON,AVE,60657,41.935796,-87.673357,1763 W WELLINGTON AVE
1,1622,W,CULLERTON,ST,60608,41.855258,-87.667139,1622 W CULLERTON ST
2,917,W,ARMITAGE,AVE,60614,41.917926,-87.651651,917 W ARMITAGE AVE
3,1132,S,WABASH,AVE,60605,41.868253,-87.626334,1132 S WABASH AVE
4,732,N,WILLARD,CT,60642,41.895400,-87.658712,732 N WILLARD CT

In [6]:
geo_database.shape

(802424, 8)

In [10]:
geo_database.dtypes

numerical      object
direction      object
streetname     object
abvr           object
zipcode        object
lat           float64
long          float64
full           object
dtype: object

In [21]:
#importing sql library
from sqlalchemy import create_engine
 
# create a reference
# for sql library
engine = create_engine('sqlite://',
                       echo = False)

In [22]:
geo_database.to_sql('data',con=engine,index=False)

802424

In [25]:
print(engine.execute("SELECT numerical FROM data LIMIT 5").fetchall())

[('1763',), ('1622',), ('917',), ('1132',), ('732',)]

In [30]:
engine.execute('''SELECT * FROM data 
WHERE numerical BETWEEN 100 and 200
AND direction = 'N' LIMIT 5''').fetchall()

[(107, '1441', 'N', 'LAVERGNE', 'AVE', '60651', 41.90715843, -87.75070037, '1441 N LAVERGNE AVE'),
 (149, '1717', 'N', 'NEWLAND', 'AVE', '60707', 41.91135018, -87.79818482, '1717 N NEWLAND AVE'),
 (290, '1509', 'N', 'MAYFIELD', 'AVE', '60651', 41.90787984, -87.77283068, '1509 N MAYFIELD AVE'),
 (299, '1145', 'N', 'LONG', 'AVE', '60651', 41.9017098, -87.76054245, '1145 N LONG AVE'),
 (312, '1924', 'N', 'BURLING', 'ST', '60614', 41.9167803, -87.64753535, '1924 N BURLING ST')]

In [ ]:

# attach the data frame to the sql
# with a name of the table
# as "Employee_Data"
dataset.to_sql('Employee_Data',
               con = engine)
 
# show the complete data
# from Employee_Data table
print(engine.execute("SELECT * FROM Employee_Data").fetchall())

In [ ]:
geo_database[n]

(1342668, 5)

In [8]:
oemc_df = pd.read_csv('oemc_locations.csv')
oemc_df.head()

  numerical directional street_name abbvr
0      7600           S     HALSTED    ST
1     10300           S   SPAULDING    AV
2      4000           W      SCHOOL    ST
3      5000           N    SHERIDAN    RD
4      6600           W      BELDEN    AV

In [9]:
oemc_df.shape

(135874, 4)

In [ ]:
geo_database[]